[
  {
    "title": "Summary",
    "text": "A software engineer working on Enterprise projects since I was 19 (for 12 years). With a high IQ of 126, I have been a fast learner and creative problem solver (I created a simple app which will generate a customized version of this resume on https://github.com/amirmv2006/amv-resume-generator). I have always finished the learning period of the companies in less than half the expected time. I get motivated by how unsolvable a problem is! The harder a problem is, the more joy it will bring when solved. I also believe one can always learn from ANYONE and love technical discussions."
  },
  {
    "title": "Experience",
    "subparts": [
      {
        "title": "<b>Experian, </b><i>Senior Software Engineer, </i>Jul 2017-Present",
        "items": [
          {
            "text": "<li> Improved performance in a use-case by 400%</li>"
          },
          {
            "text": "<li> Implemented a solution to isolate feature branch build from master caused by the use of version range</li>"
          },
          {
            "text": "<li> Created an Intellij plugin to auto-update OSGi jar files in the deploy folder</li>"
          }
        ]
      },
      {
        "title": "<b>DJavaFactory, </b><i>Senior Java Developer, </i>Apr 2016-Apr 2017",
        "items": [
          {
            "text": "<li> Came up with a solution to generate report criteria forms on the fly which helped us deliver the 150+ reports and their criteria forms on time</li>"
          },
          {
            "text": "<li> Helped other developers with their design and technical problems</li>"
          }
        ]
      },
      {
        "title": "<b>Self Employed, </b><i>N/A, </i>Mar 2015-Mar 2016",
        "items": [
          {
            "text": "<li> Consult and train a team of 8 developers with their Billing project</li>"
          }
        ]
      },
      {
        "title": "<b>Infotech, </b><i>Senior Architect, </i>May 2011-Mar 2015",
        "items": [
          {
            "text": "<li> Implemented a multi-module framework to reduce implementation cost by 70%</li>"
          },
          {
            "text": "<li> Designed and implemented a solution for final user custom querying</li>"
          },
          {
            "text": "<li> Designed and implemented a solution for embedding GUI pages in one another</li>"
          },
          {
            "text": "<li> Designed and implemented a solution for entity-level Authorization</li>"
          },
          {
            "text": "<li> Designed and implemented a solution for End-User custom reports by Jasper</li>"
          },
          {
            "text": "<li> Implemented a model-based code generator (Xtext &amp; Xpand)</li>"
          }
        ]
      },
      {
        "title": "<b>ICT-CERT, </b><i>Senior Java Developer, </i>Feb 2010-May 2011, <i>Consultant and Architect, </i>Dec 2012-May 2015 (part-time)",
        "items": [
          {
            "text": "<li> Implemented a multi-module framework to reduce implementation cost by 30%</li>"
          },
          {
            "text": "<li> Designed and implemented a solution for End-User custom reports by BIRT</li>"
          },
          {
            "text": "<li> Train a team of 5 developers</li>"
          }
        ]
      },
      {
        "title": "<b>DPco, </b><i>Junior Java Developer, </i>Sep 2006-Jul 2009 (part-time), ",
        "items": [
          {
            "text": "<li> Found a design defect which saved our company thousands of dollar</li>"
          }
        ]
      }
    ]
  },
  {
    "title": "Projects",
    "subparts": [
      {
        "title": "<b>Power-Curve</b><i>[Banking]</i>",
        "items": [
          {
            "text": "Power-Curve is an all-purpose software designed to help delivering different solutions for different organizations based on their need for every aspect of a credit-based business (such as Collections, Originations, Customer Management, etc.). The product contains a great number of tiny modules which run on OSGi and help delivery team design solutions for clients"
          },
          {
            "text": "<i>Felix, JPA, JQuery, XDocReport, Oracle/MSSQL, WebLogic, Linux, Docker/OpenShift</i>"
          }
        ]
      },
      {
        "title": "<b>TMEX</b><i>[Insurance]</i>",
        "items": [
          {
            "text": "TMEX is the Tokyo Marine Insurance application which is used to automate the process for selling Insurance products to customers. Project mainly consists of two sub-projects, front-end office (more towards sales) and back-end office (more towards product administration). Our mission was to upgrade the very old version of application and add some new features to it"
          },
          {
            "text": "<i>EJB, JPA, JQuery, Bootstrap, Oracle, Jasper, WebLogic, Linux</i>"
          }
        ]
      },
      {
        "title": "<b>Switcher</b><i>[Cryptocurrency]</i>",
        "items": [
          {
            "text": "Switcher is a web-app used for handling money transfer between 2 (and more) different blockchains. Each switcher connects two chains by having an account in each one of them. When someone wants to transfer money to another chain, they will just choose the target chain and account, and then a transfer will be made to the switcher account in their own chain (completely transparent to final user) the rest will be handled by Switcher app, meaning it will automatically make the required transfers to the intermediary switchers’ accounts so that the money is delivered to the destination account."
          },
          {
            "text": "<i>JHipster Technology Stack (https://jhipster.github.io/), Quartz scheduler, Jenkins, Docker</i>"
          }
        ]
      },
      {
        "title": "<b>Prodash</b><i>[Banking – Monitoring systems]</i>",
        "items": [
          {
            "text": "Prodash is used for monitoring CIMB devices including ATM, CDM, etc. and generating reports (Around 150 reports)."
          },{
            "text": "<i>Tapestry, Hibernate, Jasper Report, Quartz, Bootstrap, MS SQL Server, KoolChart</i>"
          }
        ]
      },
      {
        "title": "<b>TCT Billing</b><i>[Finance]</i>",
        "items": [
          {
            "text": "TCT stands for Telecommunication Company of Tehran. The company is the main service provider for telephone devices in Tehran. In order to calculate the bill amount for each customer, they had to gather billing data from different systems owned by different companies. so the goal was to create an integrated system for central billing."
          },
          {
            "text": "<i>Spring, Spring Security, ExtJS, Hibernate, Hibernate Validator, Jasper, Dozer, CXF</i>"
          }
        ]
      },
      {
        "title": "<b>Infotech Framework</b><i>[Insurance]</i>",
        "items": [
          {
            "text": "TCT stands for Telecommunication Company of Tehran. The company is the main service provider for telephone devices in Tehran. In order to calculate the bill amount for each customer, they had to gather billing data from different systems owned by different companies. so the goal was to create an integrated system for central billing."
          },{
            "text": "<i>Spring, Spring Security, ExtJS, Hibernate, Hibernate Validator, Jasper, Dozer, CXF</i>"
          }
        ]
      }
    ]
  },
  {
    "title": "Education",
    "subparts": [
      {
        "title": "<b>AMIRKABIR UNIVERSITY OF TECHNOLOGY (TEHRAN POLYTECHNIC)</b>, Tehran, Iran, 2005-2011",
        "items": [
          {
            "text": "<i>Bachelor of Science</i>"
          }
        ]
      }
    ]
  },
  {
    "title": "Skills",
    "subparts": [
      {
        "title": "<b>IELTS (2013 – 2015)</b>",
        "items": [
          {
            "text": "Listening: 7.5, Reading: 8.5, Writing: 7.5, Speaking: 6.5"
          }
        ]
      },
      {
        "title": "<b>Open-source Projects</b>",
        "items": [
          {
            "text": "Vaseline (https://github.com/amirmv2006/Vaseline): An enterprise modular framework (similar to what I’ve done on Infotech and ICT-CERT) providing generic implementation of CRUD operations and some common modules such as authentication, authorization, reporting, file management, etc."
          }
        ]
      },
      {
        "title": "<b>Technical Skills</b>",
        "items": [
          {
            "text": "Expert in: Spring (framework, boot, data, security), Jersey, CXF, JPA, Hibernate, Jasper, BIRT, OSGi (Felix, Equinox), Quartz, GWT \r\n Experienced (> 2 years) in: EJB, JQuery, Bootstrap, Docker, OpenShift, Linux, BPMN 2 (Activiti), Xtext, Xtend, Xpand, JetBrains MPS"
          }
        ]
      },
      {
        "title": "<b>Databases</b>",
        "items": [
          {
            "text": "Oracle, MSSQL, PostgreSQL"
          }
        ]
      },
      {
        "title": "<b>Enterprise Application Servers</b>",
        "items": [
          {
            "text": "WebLogic, JBoss"
          }
        ]
      },
      {
        "title": "<b>Development Tools</b>",
        "items": [
          {
            "text": "Docker, OpenShift, AWS, Jenkins, Artifactory, Atlassian package (Jira, Confluence, Bitbucket, …)"
          }
        ]
      }
    ]
  }
]